app/Controllers/LoginController.php

    public function auth() {
        $session = session();
        $model = new UsuariosModel();

        //traemos los datos del formulario
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('pass');

        $data = $model->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'admin@admin.com'
 LIMIT 1