app/Models/UsuariosModel.php

    public function getUsuarios(){
        return $this->where('baja', 'NO')->findAll();
---
SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'