app/Models/UsuariosModel.php

SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'
AND `id_perfil` = '2'
---
    public function getUsuarios(){
        return $this->where('baja', 'NO')->where('id_perfil', '2')->findAll();

SELECT *
FROM `usuarios`
WHERE `id_usuario` = '9'
 LIMIT 1
---
    public function getUsuario($id){
        return $this->where('id_usuario', $id)->first($id);

UPDATE `usuarios` SET `id_perfil` = '2', `nombre` = 'Nuevo10', `apellido` = 'Messi', `usuario` = 'Messi', `email` = 'messi@messi.com'
WHERE `usuarios`.`id_usuario` IN ('15')
---
    public function updateUsuario($id, $datos){
        return $this->update($id, $datos);